In [2]:
# Series 연산
from pandas import Series

s1 = Series([10, 15, 20], index=['일','이','삼'])
s2 = Series([2,4,6,8], index=['일','이','삼','사'])

In [3]:
s1 + 5

일    15
이    20
삼    25
dtype: int64

In [4]:
s1

일    10
이    15
삼    20
dtype: int64

In [5]:
s1 + s2

사     NaN
삼    26.0
이    19.0
일    12.0
dtype: float64

In [6]:
s3 = Series([1,2,3],index=['1줄','2줄','3줄'])
s1+s3

1줄   NaN
2줄   NaN
3줄   NaN
삼    NaN
이    NaN
일    NaN
dtype: float64

In [8]:
# DataFrame 연산

from pandas import DataFrame
import numpy as np

df1 = DataFrame(np.zeros((3,3), dtype='int32'), index=['one','two','three'])
df1

       0  1  2
one    0  0  0
two    0  0  0
three  0  0  0

In [9]:
df2 = df1 + 3
df2

       0  1  2
one    3  3  3
two    3  3  3
three  3  3  3

In [15]:
df3 = DataFrame(np.ones((4,4), dtype='int32'), index=['one','two','three','four'])
df2 + df3

# 일치 하지 않는 요소는 NaN으로 지정되고 왜 float 형으로 되나?

         0    1    2   3
four   NaN  NaN  NaN NaN
one    4.0  4.0  4.0 NaN
three  4.0  4.0  4.0 NaN
two    4.0  4.0  4.0 NaN

In [16]:
df2.add(df3)  # sub() / mul() / div() 함수에서 shift + tab 으로 도움말 확인
# other : 다른 객체, asix='columns', level=None ( 다차원일때 필요), fill_value=None (채워지는 값?)

         0    1    2   3
four   NaN  NaN  NaN NaN
one    4.0  4.0  4.0 NaN
three  4.0  4.0  4.0 NaN
two    4.0  4.0  4.0 NaN

In [17]:
df2

       0  1  2
one    3  3  3
two    3  3  3
three  3  3  3

In [ ]:
dt2 * 2

# 문자열도 있어도?

In [20]:
df4 = df2.add(df3, fill_value=0)

In [21]:
df4.median()

0    4.0
1    4.0
2    4.0
3    1.0
dtype: float64

In [ ]:
dt2 * 2

# 문자열도 있어도?